Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/Microchip.PIC32MK-GP_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.ATMEL.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>PIC32MK-GP_DFP</name>
   <description>Microchip PIC32MK-GP Series Device Support</description>
   <releases>
      <release version="1.6.144" date="2021-09-01">Correction to peripherals xml description enables watching them in I/O view.</release>
      <release version="1.5.130" date="2021-01-26">Updated deep sleep module.</release>
      <release version="1.4.117" date="2020-08-19">Updated clause 2 of the license text in headers, linker scripts and .S files to no require publication of copyright notice in embedded applications. Split RCON module. Updated CLC input names. Updated Revision ID.</release>
      <release version="1.3.90" date="2020-02-12">Updated device id information for MPLAB X.</release>
      <release version="1.2.80" date="2019-10-15">Updated size of code sector. Removed EECALDATA config bits. Renamed CLPWR bit to OPLPWR, and added HYSPOL bit to CMnCON.</release>
      <release version="1.1.54" date="2019-07-11">Added PIC32MK-GPG and PIC32MK-GPH devices. Updated name of ANO pin to AN0 for PIC32MK0512GPK064, PIC32MK0512GPL064, PIC32MK1024GPK064, and PIC32MK1024GPL064.</release>
      <release version="1.0.37" date="2019-04-16">Fixed GPIO port definitions, POSCGain and POSCFGain bit field definition, Excluded Interrupt Offset registers OFF126-129, OFF139-147, OFF151-153 on 64 pin variants.</release>
      <release version="1.0.21" date="2019-01-24">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>PIC32MK-GP</keyword>
   </keywords>
   <devices>
      <family Dfamily="PIC32MK-GP" Dvendor="Microchip:3">
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="PIC32MK0256GPG048">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MK0256GPG048.atdf"/>
                  <at:variant ordercode=""
                              vccmin="2.3"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode=""
                              vccmin="2.3"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:memory exec=""
                             name="lowerbootaliasaltconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="altboot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43f30"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootalias"
                             rw=""
                             size="0x3f30"
                             start="0x1fc00000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc04000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page0"
                             rw=""
                             size="0x1000"
                             start="0x1fc40000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page1"
                             rw=""
                             size="0x1000"
                             start="0x1fc41000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1page3"
                             rw=""
                             size="0xf30"
                             start="0x1fc43000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc44000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="code"
                             rw=""
                             size="0x80000"
                             start="0x1d000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliasconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="adccal"
                             rw=""
                             size="0x1c"
                             start="0x1fc45000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="serial"
                             rw=""
                             size="0x10"
                             start="0x1fc45020"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="eedatacal"
                             rw=""
                             size="0x10"
                             start="0x1fc45030"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="devid"
                             rw=""
                             size="0x0"
                             start="0xffffffff"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="emulation"
                             rw=""
                             size="0x100000"
                             start="0xff300000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="kseg0_data_mem"
                             rw=""
                             size="0x10000"
                             start="0x00000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_std"
                             rw=""
                             size="0x2000"
                             start="0x1f800000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_fast"
                             rw=""
                             size="0x2000"
                             start="0x1f810000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb2_std"
                             rw=""
                             size="0xe200"
                             start="0x1f820000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb3_std"
                             rw=""
                             size="0xc800"
                             start="0x1f840000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb4_std"
                             rw=""
                             size="0x700"
                             start="0x1f860000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb5_std"
                             rw=""
                             size="0xb000"
                             start="0x1f880000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb6_std"
                             rw=""
                             size="0x400"
                             start="0x1f8c0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_ssx"
                             rw=""
                             size="0x10000"
                             start="0x1f8f0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="testmem"
                             rw=""
                             size="0x1000"
                             start="0x1fc42000"
                             type=""
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MK0256GPG048.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MK0256GPG048"
                  title="Device page for PIC32MK0256GPG048"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MK0256GPG048"
                  title="Datasheet"/>
         </device>
