Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.6.144/Microchip.PIC32MK-GP_DFP.pdsc
         <device Dname="PIC32MK0512GPD100">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MK0512GPD100.atdf"/>
                  <at:variant ordercode=""
                              vccmin="2.2"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"/>
                  <at:memory exec=""
                             name="upperbootaliasconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc23fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot2config"
                             rw=""
                             size="0x50"
                             start="0x1fc63fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1"
                             rw=""
                             size="0x3fb0"
                             start="0x1fc40000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc44000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot2"
                             rw=""
                             size="0x3fb0"
                             start="0x1fc60000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot2lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc64000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="upperbootalias"
                             rw=""
                             size="0x3fb0"
                             start="0x1fc20000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="upperbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc24000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootalias"
                             rw=""
                             size="0x3fb0"
                             start="0x1fc00000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc04000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="code"
                             rw=""
                             size="0x80000"
                             start="0x1d000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliasconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="adccal"
                             rw=""
                             size="0x1c"
                             start="0x1fc45000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="serial"
                             rw=""
                             size="0x10"
                             start="0x1fc45020"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="eedatacal"
                             rw=""
                             size="0x10"
                             start="0x1fc45030"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="devid"
                             rw=""
                             size="0x0"
                             start="0xffffffff"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="emulation"
                             rw=""
                             size="0x100000"
                             start="0xff300000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="kseg0_data_mem"
                             rw=""
                             size="0x20000"
                             start="0x00000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_std"
                             rw=""
                             size="0x2000"
                             start="0x1f800000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_fast"
                             rw=""
                             size="0x2000"
                             start="0x1f810000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb2_std"
                             rw=""
                             size="0xe200"
                             start="0x1f820000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb3_std"
                             rw=""
                             size="0xc800"
                             start="0x1f840000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb4_std"
                             rw=""
                             size="0x700"
                             start="0x1f860000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb5_std"
                             rw=""
                             size="0xb000"
                             start="0x1f880000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb6_std"
                             rw=""
                             size="0x400"
                             start="0x1f8c0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_ssx"
                             rw=""
                             size="0x10000"
                             start="0x1f8f0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="testmem"
                             rw=""
                             size="0x1000"
                             start="0x1fc65000"
                             type=""
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MK0512GPD100.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MK0512GPD100"
                  title="Device page for PIC32MK0512GPD100"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MK0512GPD100"
                  title="Datasheet"/>
         </device>
         <device Dname="PIC32MK0512GPE064">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MK0512GPE064.atdf"/>
                  <at:variant ordercode=""
                              vccmin="2.2"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"/>
                  <at:variant ordercode=""
                              vccmin="2.2"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"/>
                  <at:memory exec=""
                             name="upperbootaliasconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc23fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1config"
                             rw=""
                             size="0x50"
                             start="0x1fc43fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot2config"
                             rw=""
                             size="0x50"
                             start="0x1fc63fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1"
                             rw=""
                             size="0x3fb0"
                             start="0x1fc40000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot1lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc44000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot2"
                             rw=""
                             size="0x3fb0"
                             start="0x1fc60000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="boot2lastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc64000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="upperbootalias"
                             rw=""
                             size="0x3fb0"
                             start="0x1fc20000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="upperbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc24000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootalias"
                             rw=""
                             size="0x3fb0"
                             start="0x1fc00000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliaslastpage"
                             rw=""
                             size="0x1000"
                             start="0x1fc04000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="code"
                             rw=""
                             size="0x80000"
                             start="0x1d000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="lowerbootaliasconfig"
                             rw=""
                             size="0x50"
                             start="0x1fc03fb0"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="adccal"
                             rw=""
                             size="0x1c"
                             start="0x1fc45000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="serial"
                             rw=""
                             size="0x10"
                             start="0x1fc45020"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="eedatacal"
                             rw=""
                             size="0x10"
                             start="0x1fc45030"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="devid"
                             rw=""
                             size="0x0"
                             start="0xffffffff"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="emulation"
                             rw=""
                             size="0x100000"
                             start="0xff300000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="kseg0_data_mem"
                             rw=""
                             size="0x20000"
                             start="0x00000000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_std"
                             rw=""
                             size="0x2000"
                             start="0x1f800000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb1_fast"
                             rw=""
                             size="0x2000"
                             start="0x1f810000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb2_std"
                             rw=""
                             size="0xe200"
                             start="0x1f820000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb3_std"
                             rw=""
                             size="0xc800"
                             start="0x1f840000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb4_std"
                             rw=""
                             size="0x700"
                             start="0x1f860000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb5_std"
                             rw=""
                             size="0xb000"
                             start="0x1f880000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_pb6_std"
                             rw=""
                             size="0x400"
                             start="0x1f8c0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="periph_ssx"
                             rw=""
                             size="0x10000"
                             start="0x1f8f0000"
                             type=""
                             address-space="base"/>
                  <at:memory exec=""
                             name="testmem"
                             rw=""
                             size="0x1000"
                             start="0x1fc65000"
                             type=""
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MK0512GPE064.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MK0512GPE064"
                  title="Device page for PIC32MK0512GPE064"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MK0512GPE064"
                  title="Datasheet"/>
         </device>
